W7D1/rails_auth/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "slagathor1212"], ["password_digest", "$2a$12$rECaVrk8vMHqaujklTlSku0nBedCQQ81EObxHFzVWaufhEp9uHmZe"], ["session_token", "hh2fzfh7VbLq4A2wTyvC9g"]]